Just some programming exercises.
*** 8 Path Cleaninggg (8)
Clean up a path name, dealing with ., .., and // in path names.
#+BEGIN_SRC python :results output
  from collections import deque

  def clean_path(pathname):
      stack = deque()
      word = ""
      for char in pathname:
          if char == "/":
              if word == "." or word == "":
                  pass
              elif word == "..":
                  stack.pop()
              else:
                  stack.append(word)
              word = ""
          else:
              word = word + char
      if word:
          stack.append(word)
      return "/".join(stack)

  print(clean_path("scripts//./../scripts/awkscripts/././"))
  print(clean_path("/usr/lib/../bin/gcc"))


#+END_SRC

#+RESULTS:
: scripts/awkscripts
: usr/bin/gcc

*** 12 Queue from Two Stacks
#+BEGIN_SRC python :results output 
  from collections import deque

  class stack2q(object):

      def __init__(self, vals=[]):
          self.stack1 = deque()
          self.stack2 = deque()
          for k in vals:
              self.enq(k)

      def enq(self, value):
          while self.stack1:
              self.stack2.append(self.stack1.pop())
          self.stack1.append(value)
          while self.stack2:
              self.stack1.append(self.stack2.pop())

      def deq(self):
          return self.stack1.pop()

  test = stack2q([1, 2, 3, 4])
  print(test.deq())
  print(test.deq())
  print(test.deq())
#+END_SRC

#+RESULTS:
: 1
: 2
: 3

*** 13 Queue with Max

#+BEGIN_SRC python :results output
  from collections import deque


  class maxq(object):
      def __init__(self, inval=[]):
          self.valq = deque()
          self.maxq = deque()
          for k in inval:
              self.enq(k)

      def enq(self, value):
          self.valq.append(value)
          if self.maxq:
              self.maxq.append(max(value, self.maxq[-1]))
          else:
              self.maxq.append(value)

      def deq(self):
          self.maxq.pop()
          return self.valq.pop()

      def get_max(self):
          return self.maxq[-1]

  test = maxq([1, 2, 3])
  print(test.get_max())
  test.enq(5)
  print(test.get_max())
  test.enq(2)
  print(test.get_max())
  test.enq(7)
  print(test.get_max())
  test.deq()
  print(test.get_max())
  test.deq()
  print(test.get_max())
  test.deq()
  print(test.get_max())
  test.deq()
  print(test.get_max())
#+END_SRC

#+RESULTS:
: 3
: 5
: 5
: 7
: 5
: 5
: 3
: 2

*** 14 Maximum of a Sliding Windoww
#+BEGIN_SRC python :results output
  from collections import deque

  def window_max(data, window_size):
      """Find maximum of sliding window, assume data is list of 2-ples"""
      actual_size = 0
      max_sum = 0
      current_sum = 0
      queue = deque()

      for k in data:
          if actual_size < window_size:
              queue.append(k)
              actual_size += 1
              current_sum += k[1]
              if current_sum > max_sum:
                  max_sum = current_sum
              continue
          queue.append(k)
          current_sum = current_sum + k[1] - queue.popleft()[1]
          if current_sum > max_sum:
              max_sum = current_sum
      return max_sum

  data = list(zip([1, 2, 3, 4, 5, 6, 7, 8, 9], [3, 5, 2, 6, 8, 3, 1, 1, 2]))
      
  print(window_max(data, 2))
  print(window_max(data, 3))
  print(window_max(data, 4))
  print(window_max(data, 5))
  print(window_max(data, 7))
  
#+END_SRC

#+RESULTS:
: 14
: 17
: 21
: 24
: 28

*** Binary Tree Problems 
Many problems in the code-block below, due to the reliance on the same tree classes
#+BEGIN_SRC python :results output :tangle tree.py
  from copy import deepcopy
  from collections import deque

  class tree(object):
      """ Simple tree implementation, where a tree is a list of lists (of lists), leaves are
      lists with a single entry, and any subsequent entries represent children."""
      def __init__(self, rootval, children=[]):
          if isinstance(rootval, list):
              self.value = rootval[0]
              self.children = []
              for k in rootval[1:]:
                  if k:
                      self.add_child(tree(k))
          else:
              self.value = rootval
              self.children = children

      def __repr__(self):
          return str(self.to_list())

      def get_val(self):
          return self.value

      def add_child(self, node):
          self.children.append(node)

      def get_child(self, num):
          return self.children[num]

      def get_children(self):
          return self.children

      def get_depths(self, start_depth=0):
          data = [start_depth]
          for child in self.get_children():
              for child_datum in child.get_depths(start_depth + 1):
                  data.append(child_datum)
          return data

      def to_list(self):
          temp = list(self.children)
          temp.insert(0, self.value)
          return temp


  class binary_tree(tree):

      def __init__(self, rootval, children=[]):
          if isinstance(rootval, list):
              self.value = rootval[0]
              self.children = [binary_tree(x) if x else x for x in rootval[1:]
              ] + [None for x in range(2-len(rootval[1:]))]
          els(self):
          return self.children[0]

      def get_right(self):
          return self.children[1]

      def set_left(self, node):
          self.children[0] = node

      def set_right(self, node):
          self.children[1] = node

      def get_tree_height(self):
          left_height = self.left().get_tree_height() if self.left() else 0
          right_height = self.right().get_tree_height() if self.right() else 0
          return 1 + max(left_height, right_height)

      ## 9.1: Check if balanced
      def is_balanced(self):
          """ Return height of tree, or None if not balanced"""
          left_height = self.get_left().is_balanced() if self.get_left() else 0
          right_height = self.get_right().is_balanced() if self.get_right() else 0
          if left_height == None or right_height == None or abs(right_height -
                                                        left_height) > 1:
              return None
          else:
              return 1 + max(left_height, right_height)

      ## 9.2: k-balanced nodes
      # def kbalanced(self)

      ## 9.3 symmetric tree
      def is_symmetric(self):
          """Return true if symmetric tree, else false"""
          def symmetric_helper(left_node, right_node):
              if bool(left_node) != bool(right_node): # If one exists and other doesn't, False
                  return False
              if not (left_node or right_node): # If neither exists, True
                  return True
              if not left_node.get_val() == right_node.get_val(): # If both exist but have different values, False
                  return False
              # Otherwise, both exist, have same values, compare children...
              return (symmetric_helper(left_node.get_left(), right_node.get_right())
                      and symmetric_helper(left_node.get_right(), right_node.get_left()))
          return symmetric_helper(self.get_left(), self.get_right())

      ## 9.7 reconstruct from inorder and preorder or postorder
      def reconstruct_inorder_preorder(inorder, preorder):
          """Reconstruct tree from inorder and preorder lists"""
          if len(inorder) == 0:
              return None
          rootindex = inorder.index(preorder[0])
          root = binary_tree(preorder[0],
                             [binary_tree.reconstruct_inorder_preorder(inorder[:rootindex], preorder[1:1+rootindex]),
                              binary_tree.reconstruct_inorder_preorder(inorder[rootindex+1:], preorder[rootindex+1:])])
          return root

      ## 9.8 reconstruct tree from preorder transversal with null for empty nodes
      def null_reconstruct_preorder(preorder):
          if len(preorder) == 1:
              return None
          tcount, ncount = 0, 0
          left = []
          for i, k in enumerate(preorder[1:]):
              if not k == None:
                  tcount += 1
              else:
                  ncount += 1
              left.append(k)
              if ncount == tcount * 2 - (tcount - 1):
                  right = preorder[i+2:]
                  break
          root = binary_tree(preorder[0])
          if root:
              root.set_left(binary_tree.null_reconstruct_preorder(left))
              root.set_right(binary_tree.null_reconstruct_preorder(right))
          return root

      ## 9.9 Form linked list from leaf nodes of tree
      def linked_list_from_leaves(node):
          linked_list = []
          if node.get_left():
              linked_list += binary_tree.linked_list_from_leaves(node.get_left())
          if node.get_right():
              linked_list += binary_tree.linked_list_from_leaves(node.get_right())
          if not (node.get_left() or node.get_right()):
              linked_list.append(node.get_val())
          return linked_list

      # ## 9.10 Print exterior of binary tree in anti-clockwise: nodes on
      # ## path to leftmost leaf, then leaves left-right, then nodes of rightmost
      # ## to root

      # # Assuming that going left/right until first leaf matches definition; unclear
      # def binary_tree_exterior(node):
      #     def print_left_anticlockwise(node):
      #         the_list = [node.get_val()]
      #         if node.get_left():
      #             the_list += print_left_anticlockwise(node.get_left)
      #         elif node.get_right():
      #             the_list += print_left_anticlockwise(node.get_right)
      #         return the_list

      #     def print_left_anticlockwise(node):
      #         the_list = [node.get_val()]
      #         if node.get_left():
      #             the_list += print_left_anticlockwise(node.get_left)
      #         elif node.get_right():
      #             the_list += print_left_anticlockwise(node.get_right)
      #         return the_list

      ## 9.11 Lowest common ancestor
      # Assumes values are unique
      def lowest_common_ancestor(root, vals):

          # Breadth-first search
          def lca_helper(root, queue):
              if root.get_left():
                  queue.append(root.get_left())
                  ancestry[root.get_left().get_val()] = root
              if root.get_right():
                  queue.append(root.get_right())
                  ancestry[root.get_right().get_val()] = root

          # Keep track of history for path recreation
          queue = deque()
          ancestry = {root.get_val(): None}
          lca_helper(root, queue)
          while queue and not all([x in ancestry for x in vals]):
              # print(visited_queue, vals)
              curnode = queue.popleft()
              lca_helper(curnode, queue)

          # Generate paths out of node path history
          paths = {}
          for k in vals:
              paths[k] = []
              ancestry_pather = k
              while ancestry_pather:
                  paths[k].append(ancestry_pather)
                  if ancestry[ancestry_pather]:
                      ancestry_pather = ancestry[ancestry_pather].get_val()
                  else:
                      ancestry_pather = None
          # Go through paths, looking for earliest common member
          for path in paths:
              for path_member in paths[path]:
                  if all([path_member in paths[x] for x in paths]):
                      return path_member
          # Doesn't exist
          return None

  testtree = binary_tree([3, [1, [2, [3, [4]]]], [3, [2], [3]]])
  balanced_tree = binary_tree([3, [2, [1], [3]], [2, [3], [3]]])
  symmetric_tree = binary_tree([3, [2, [3], [2]], [2, [2], [3]]])
  # print(testtree.get_depths())
  # print(testtree.is_balanced())
  # print(balanced_tree.is_balanced())
  # print(testtree.is_symmetric())
  # print(symmetric_tree.is_symmetric())

  chartree = binary_tree(['H', ['B', ['F', None, None], ['E', ['A', None, None], None]], ['C', None, ['D', None, ['G', ['I', None, None], None]]]])
  chartree_inorder = ['F', 'B', 'A', 'E', 'H', 'C', 'D', 'I', 'G']
  chartree_preorder = ['H', 'B', 'F', 'E', 'A', 'C', 'D', 'G', 'I']
  # nc = binary_tree.reconstruct_inorder_preorder(chartree_inorder, chartree_preorder)
  # print(chartree.to_list())
  # print(nc)

  # chartree_preorder_marked = ['H', 'B', 'F', None, None, 'E', 'A',
  #                             None, None, None, 'C', None, 'D',
  #                             None, 'G', 'I', None, None, None]
  # print(chartree)
  # print(binary_tree.null_reconstruct_preorder(chartree_preorder_marked))

  # print (binary_tree.linked_list_from_leaves(chartree))
  print(binary_tree.lowest_common_ancestor(chartree, ['B', 'D']))
  print(binary_tree.lowest_common_ancestor(chartree, ['I', 'D', 'G']))
#+END_SRC

#+RESULTS:
: H
: D

*** DONE 2 Counting Inversions
CLOSED: [2015-05-24 Sun 14:30]
Array A of n numbers, returns number of pairs of indicies so that i < j and A[i] and A[j]. nlogn
#+BEGIN_SRC python :results output
  A = [3, 8, 2, 4, 6, 3]

  ## Basic, n^2
  def count_inv1(A):
      sum = 0
      for i, num1 in enumerate(A):
          for k, num2 in enumerate(A):
              if i < k and num1 > num2:
                  sum += 1
      return sum

  ## Mergesort-like, nlogn
  def count_inv2(A):
      if len(A) < 5:
          return count_inv1(A) 
      mid = int(len(A)/2)
      left = count_inv2(A[:mid])
      right = count_inv2(A[mid:])
      sum = left + right
      for a in A[:mid]:
          for b in A[mid:]:
              if a > b:
                  sum += 1
      return sum

  print(count_inv2(A))
      
#+END_SRC

#+RESULTS:
: 7

*** DONE 3 Nearest Points in the Plane
CLOSED: [2015-05-24 Sun 14:30]
Find the nearest points in a plane, preferably without comparing every single pair.
#+BEGIN_SRC python :results output
  from collections import namedtuple

  p = namedtuple('p', ['x', 'y'])
  sol = namedtuple('sol', ['p1', 'p2', 'dist'])

  points = [p(1, 3), p(4, 2), p(8, 3), p(5, 5), p(3, 5)]

  def find_minimum_distance(points):
      def distance(p1, p2):
           return ((p2.x - p1.x)**2 + (p2.y - p1.y)**2)

      def brute_force(points):
          bestsol = sol(None, None, 9999999)
          for i, a in enumerate(points):
              for b in points[i:]:
                  if a != b and distance(a, b) < bestsol.dist:
                      bestsol = sol(a, b, distance(a, b))
          return bestsol

      # Handle few points
      if len(points) < 7:
          return brute_force(points)

      points = points.sort(key=lambda x: x.y)

      mid = int(len(points)/2)
      left = [x for x in points[:mid]]
      right = [x for x in points[mid:]]
      sol_left = find_minimum_distance(left)
      sol_right = find_minimum_distance(right)
      min_sol = min(sol_left, sol_right, key=lambda x: x.dist)
      # Look at overlaps
      center_y = points[mid].y
      overlap_points = [x for x in points if
                        x.y < center_y + min_sol.dist or
                        x.y > center_y - min_sol.dist]

      best_overlap = brute_force(overlap_points)
      return min(min_sol, best_overlap, key=sol.dist)

  print(find_minimum_distance(points))
#+END_SRC

#+RESULTS:
: sol(p1=p(x=5, y=5), p2=p(x=3, y=5), dist=4)

*** DONE 2 Transform one string into another
CLOSED: [2015-05-24 Sun 20:45]
Find the shortest paths to connect a list of words using a given dictionary. Can either only use replacements, or include off-by-1 character insertions/deletions. Bytearrays used for efficiency of single-character operations (they're mutable). 
#+BEGIN_SRC python :results output
  from collections import deque

  # 'words' is assumed to be input file of words separated by newlines. Imported here
  f = open('words', 'r')
  wordlist = f.readlines()
  wordlist = [bytes(x.strip("\n").lower(), 'ASCII') for x in wordlist]
  wordict = {}
  for line in wordlist:
      wordict[line] = []
      f.close()

  letters = bytearray(b'abcdefghijklmnopqrstuvwxyz')

  def find_word_path(words, global_wordict, allow_insertions=False):
      """Find shortest path between the list of passed words, using a global dictionary.
      Strategy:
      For each word, breadth-first expansion until all the 'globes' meet."""
      def maybe_add_word(word, new_word):
          """Slight abstraction, see if the generated word should be added and if it should,
          add it"""
          if bytes(new_word) in global_wordict and bytes(new_word) not in mworddict[word]:
              mworddict[word][bytes(new_word)] = bytes(current_word)
              mqueue[word].append(new_word)
              new_words.add(bytes(new_word))        

      words = [bytes(word, 'ASCII') for word in words]
      mworddict = {word: {word: None} for word in words}
      mqueue = {word: deque([bytearray(word)]) for word in words}

      while(1):
          new_words = set()        
          for word in words:
              try:
                  current_word = bytearray(mqueue[word].pop())
              except:
                  return None
              for index, letter in enumerate(current_word):
                  ## Letter replacements
                  for replacement_letter in letters:
                      new_word = bytearray(current_word)
                      new_word[index] = replacement_letter
                      maybe_add_word(word, new_word)
                  if allow_insertions:
                      ## Letter insertions
                      for new_letter in letters:
                          new_word = bytearray(current_word)
                          new_word.insert(index, new_letter)
                          maybe_add_word(word, new_word)
                      ## Letter Deletions
                          new_word = bytearray(current_word)
                          del new_word[index]
                          maybe_add_word(word, new_word)

          # Check whether any newly_added word is globally visible                    
          for new_word in new_words:
              if all([new_word in mworddict[word] for word in mworddict]):

                  # If it is, extract paths to that word from every starting word
                  paths = {word.decode('utf-8'): [] for word in words}
                  for word in words:
                      word_string = word.decode('utf-8')
                      word_iterator = new_word
                      while(word_iterator):
                          paths[word_string].append(word_iterator)
                          word_iterator = mworddict[word][word_iterator]
                      paths[word_string].reverse()
                      paths[word_string] = [x.decode('utf-8') for x in paths[word_string]]
                  return paths
                      
  print(find_word_path(["what", "cat", "hearse"], wordict, True))
  print(find_word_path(["what", "when"], wordict))    
      

#+END_SRC

#+RESULTS:
: {'cat': ['cat', 'hat'], 'hearse': ['hearse', 'hears', 'hearts', 'hearth', 'heath', 'heat', 'hat'], 'what': ['what', 'hat']}
: {'when': ['when', 'whet'], 'what': ['what', 'whet']}

*** solution
#+BEGIN_SRC python
  inorder = ['d', 'g', 'b', 'e', 'a', 'c', 'h', 'f']
  postorder  = ['g', 'd', 'e', 'b', 'h', 'f', 'c', 'a']
  def build_tree(ino, posto):
      if len(ino) == 0:
          return None
      elif len(ino) == 1:
          return (ino, None, None)
      curnode = posto[-1]
      in_index = ino.index(curnode)
      leftin = ino[0:in_index]
      rightin = ino[in_index+1:]
      leftpost = posto[0:in_index]
      rightpost = posto[in_index:-1]
      left = build_tree(leftin, leftpost)
      right = build_tree(rightin, rightpost)
      return (curnode, left, right)
  return build_tree(inorder, postorder)        
#+END_SRC

#+RESULTS:
| a | (b (d None ((g) None None)) ((e) None None)) | (c None (f ((h) None None) None)) |

 
*** BST, two common values
Assumes tree is a BST, only takes two values.
    5
   3  7
 1 4 6 8

#+BEGIN_SRC python
  tree = (5, (3, (1, None, None), (4, None, None)), (7, (6, None, None), (8, None, None)))

  def lowest_common_ancestor(a, b, tree):
      if (min(a,b) < tree[0]) and (max(a,b) > tree[0]):
          return tree[0]
      elif b < tree[0]:
          return lowest_common_ancestor(a, b, tree[1])
      else:
          return lowest_common_ancestor(a, b, tree[2])

  return lowest_common_ancestor(6, 4, tree)
      
#+END_SRC 

#+RESULTS:
: 5

** Balance an unbalanced BST
Balance a tree, knowing that the left side is larger than the right.
       7
     5   8
   4  6
 3

#+BEGIN_SRC python
tree = [7, [5, [4, [3, [2, None, None], None], None], [6, None, None]], [8, None, None]]

def balance_once(head):
    old_head = list(head)
    head = head[1]
    old_head[1] = head[2]
    head[2] = old_head
    return head

return balance_once(tree)
#+END_SRC

#+RESULTS:
| 5 | (4 (3 (2 None None) None) None) | (7 (6 None None) (8 None None)) |

*** Strategy
Actors are nodes, movies are edges between them.

Start at actor. Breadth first search of all neighbors. Maintain dictionary of visited actors and shortest paths to them. Once all actors exhausted or no more moves available, return shortest path to Kevin Bacon.

Visit a node if never visited. Update path. New path will never be shorter than old due to this being a breadth-first search.

#+BEGIN_SRC python
  from collections import deque

  class actor:
      def __init__(self, name, neighbors):
          self.name = name
          self.neighbors = neighbors
          
      def getneighbors(self):
          return self.neighbors

      def setneighbors(self, neighbors):
          self.neighbors = neighbors

      def getname(self):
          return self.name        

  w = actor('w', [])
  x = actor('x', [])
  y = actor('y', [])
  z = actor('z', [])

  w.setneighbors([z, y])
  x.setneighbors([y])
  y.setneighbors([x, z, w])
  z.setneighbors([y, w])


  def shortest_path(init, searchee):
      path_dict = {}
      Q = deque()
      Q.append(init)
      path_dict[init] = []
      while Q:
          acts_visited = [] # In case there are two edges connecting same actors
          curnode = Q.pop()
          if curnode == searchee:
              path_dict[searchee].append(searchee)
              return path_dict[searchee]
          for k in curnode.getneighbors():
              if (k not in acts_visited) and k not in path_dict:
                  Q.append(k)
                  acts_visited.append(k)
                  path_dict[k] = list(path_dict[curnode])
                  path_dict[k].append(curnode)

  return [k.getname() for k in shortest_path(x, z)]                

#+END_SRC

#+RESULTS:
| x | y | z |

** Word-neighbors
You're given two words. Find the shortest path between them, where a single move entails switching a single letter in each word (or inserting one), and each intermediary step must be a valid word. 

First step is generating the neighbors for every word. This script does that, both for the case with only letter-swapping and then with letter-insertion as well. This is then pickled, so it doesn't have to be done again and again while testing.
#+BEGIN_SRC python
  import pickle

  f = open('wordlist.txt', 'r')
  wordlist = f.readlines()
  wordlist = [x.strip("\n").lower() for x in wordlist]
  wordict = {}
  for line in wordlist:
      wordict[line] = []
  f.close()

  letters = list('abcdefghijklmnopqrstuvwxyz')
  for word in wordlist:
      for i, letter in enumerate(list(word)): # Letter replacement
          for repletter in letters:
              neword = list(word)            
              neword[i] = repletter
              temp = "".join(neword)
              if temp in wordict and temp not in wordict[word]:
                  wordict[word].append(temp)
  pikl_file = open('replacement_wordict.pkl', 'wb') 
  pickle.dump(wordict, pikl_file)
  pikl_file.close()

  for word in wordlist:                
      for i in range(len(word)+1): # letter insertion
          for repletter in letters:
              neword = list(word)            
              neword.insert(i, repletter)
              temp = "".join(neword)
              if temp in wordict and temp not in wordict[word]:
                  wordict[word].append(temp)

  pikl_file = open('replacement_and_insertion_wordict.pkl', 'wb') 
  pickle.dump(wordict, pikl_file)
  pikl_file.close()                
#+END_SRC

#+RESULTS:
: None


This code implements a simple algorithm, which travels in a single direction between two words. It's inefficient, as looking searching for a match from two directions will search exponentially fewer words.
#+BEGIN_SRC python
  from collections import deque
  import pickle

  f = open('wordlist.txt', 'r')                      
  wordlist = f.readlines()                           
  wordlist = [x.strip("\n").lower() for x in wordlist]
  f.close()

  pikl_file = open('replacement_and_insertion_wordict.pkl', 'rb')
  wordict = pickle.load(pikl_file)
  pikl_file.close()
      
  def findpath(word1, word2):
      stack = deque()
      stack.append(word1)
      visitedWords = {word1:1}
      while 1:
          if stack:
              curnode = stack.popleft()
          else:
              return None
          for k in wordict[curnode]:
              if (k == word2):
                  m = visitedWords[curnode]
                  theanswer = [k, curnode]
                  while m != 1:
                      theanswer.append(m)
                      m = visitedWords[m]                    
                  return theanswer
              if k not in visitedWords:
                  visitedWords[k] = curnode
                  stack.append(k)

  return findpath('a', 'bent')

#+END_SRC

#+RESULTS:
| bent | ben | be | b | a |

This script does a similar thing, but instead of working with two words, it works for n words. And it's faster, because it approaches from all sides! Basically, it's looking for the shortest paths to connect all the given words.

#+BEGIN_SRC python
#!/usr/bin/env python
from collections import deque
import pickle

f = open('wordlist.txt', 'r')                      
wordlist = f.readlines()                           
wordlist = [x.strip("\n").lower() for x in wordlist]
f.close()

pikl_file = open('replacement_and_insertion_wordict.pkl', 'rb')
wordict = pickle.load(pikl_file)
pikl_file.close()

def findpath_multiple(input_list):
    visitedwords = [{word: None} for word in input_list]
    paths = [[] for word in input_list]
    deques = [deque() for word in input_list]
    curword = [1 for word in input_list]
    for k in range(len(deques)):
        deques[k].append(input_list[k])

    while 1:
        for commonword in visitedwords[0]:
            if all([commonword in visitedwords[x] for x in range(0, len(input_list))]):
                for i, word in enumerate(input_list):
                    m = commonword
                    while m != None:
                        paths[i].append(m)
                        m = visitedwords[i][m]
                return(commonword, paths)
        for i, word in enumerate(input_list):
            if deques[i]:
                curword[i] = deques[i].popleft()
            else:
                return None
            for neighbor in wordict[curword[i]]:
                if neighbor not in visitedwords[i]:
                    visitedwords[i][neighbor] = curword[i]
                    deques[i].append(neighbor)
        
return(findpath_multiple(['bath', 'kent', 'what']))
#+END_SRC

#+RESULTS:
| cast | ((cast cash bash bath) (cast cant cent kent) (cast cost coat chat what)) |

